In [2]:
import matplotlib.pyplot as plt
print(plt.get_backend())

module://matplotlib_inline.backend_inline

In [1]:
# %matplotlib inline - matplotlib inline is the default backend in a jupyter notebook, now no longer required
import pandas as pd

In [7]:
'''
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))
'''

In [2]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961
4                            Homo Faber  1991

In [3]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [39]:
len(titles)

226013

### What are the earliest two films listed in the titles dataframe?

In [41]:
titles.sort_values('year').head(2)

                     title  year
67819           Miss Jerry  1894
207284  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [100]:
# Depending on how you interpret the question you can arrive at different counts 

# Only count titles that appear as 'Hamlet'
count = (titles['title'] == 'Hamlet').sum()
print("Number of titles appearing as 'Hamlet': " + str(count))

# Count the number of titles that start with the word 'Hamlet' 
count2 = titles['title'].str.startswith('Hamlet').sum()
print("Number of titles that start with 'Hamlet': " + str(count2))

# Count the number of titles that contain the word 'Hamlet' in them 
count3 = titles['title'].str.contains(r'Hamlet').sum()
print("Number of titles that contain 'Hamlet': " + str(count3))

Number of titles appearing as 'Hamlet': 20
Number of titles that start with 'Hamlet': 40
Number of titles that contain 'Hamlet': 55

In [99]:
titles.title[titles['title'].str.contains(r'Hamlet')]

4760                           A Sagebrush Hamlet
6783                                  Hamlet (II)
11143                      Hamlet in the Hamptons
14413                              Kitchen Hamlet
18430                                    Hamlet 2
22516                                      Hamlet
27282                                      Hamlet
33005                                      Hamlet
38298                   Hamlet, Prince of Denmark
42263                                      Hamlet
43896                              Hamlet Unbound
52395                                      Hamlet
56073                                 Fuck Hamlet
61104                                      Hamlet
63445                              Hamlet/Horatio
65986                    Hamlet, Son of a Kingpin
71088                                 Hamlet (II)
84358                                      Hamlet
86506                   Hamlet in the Golden Vale
86508                 Intikam Melegi/Kadin Hamlet
90989                   Hamlet the Vampire Slayer
93844     The Tragedy of Hamlet Prince of Denmark
97195                        Hamlet Demonstration
99427               Hamlet: The Fall of a Sparrow
100396                  Hamlet: Prince of Denmark
102852                                   Hamlet X
103798                         Han, hun og Hamlet
104292                                     Hamlet
114224                                     Hamlet
117952                              Hamlet A.D.D.
119517                                Hamlet (II)
120670          Royal Shakespeare Company: Hamlet
121837              National Theatre Live: Hamlet
122000                                     Hamlet
126862                                     Hamlet
136835                                Hamlet (II)
140267                                     Hamlet
142304                                     Hamlet
148015            Dogg's Hamlet, Cahoot's Macbeth
150932                         Han, hun og Hamlet
151503        Predstava 'Hamleta' u Mrdusi Donjoj
152474                      Green Eggs and Hamlet
153773                                     Hamlet
165082                        Harry, Hamlet and I
167194                               Hamlet (III)
167198                                     Hamlet
168528                                     Hamlet
170016                                     Hamlet
175118                                     Hamlet
182160                             Hamlet's Ghost
190376                                     Hamlet
191868                                     Hamlet
203335                              Zombie Hamlet
208269                               H for Hamlet
215453                     Hamlet liikemaailmassa
Name: title, dtype: object

### How many movies are titled "North by Northwest"?

In [102]:
titles['title'].str.fullmatch(r'North by Northwest').sum()

1

### When was the first movie titled "Hamlet" made?

In [104]:
hamlets = titles[titles.title == 'Hamlet'].sort_values('year')
hamlets.head(1)

         title  year
170016  Hamlet  1910

In [106]:
hamlets2 = titles[titles.title.str.startswith(r'Hamlet')].sort_values('year')
hamlets2.head(1)

         title  year
170016  Hamlet  1910

In [109]:
hamlets3 = titles[titles.title.str.contains(r'Hamlet')].sort_values('year')
hamlets3.head(1)

         title  year
170016  Hamlet  1910

Reguardless of how we filtered `title`, the first movie will be Hamlet 1910 since it is the earliest movie containing the word `Hamlet`.

### List all of the "Treasure Island" movies from earliest to most recent.

In [111]:
treasure_island_movies = titles[titles.title == 'Treasure Island'].sort_values('year')
treasure_island_movies

                  title  year
156319  Treasure Island  1918
165371  Treasure Island  1920
137464  Treasure Island  1934
184980  Treasure Island  1950
191292  Treasure Island  1972
89978   Treasure Island  1973
159906  Treasure Island  1985
191353  Treasure Island  1999

### How many movies were made in the year 1950?

In [120]:
made_in_1950 = titles[titles.year == 1950]
len(made_in_1950)

1109

### How many movies were made in the year 1960?

In [121]:
made_in_1960 = titles[titles.year == 1960]
len(made_in_1960)

1496

### How many movies were made from 1950 through 1959?

In [124]:
made_between_1950_1959 = titles[(1950 < titles.year) & (titles.year < 1959)]
len(made_between_1950_1959)

10093

### In what years has a movie titled "Batman" been released?

In [10]:
t = titles[titles.title == 'Batman']
t

        title  year
20791  Batman  1989
68816  Batman  1943

### How many roles were there in the movie "Inception"?

In [11]:
inception_cast = cast[(cast.title == 'Inception')]
len(inception_cast)

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [11]:
n_nas = inception_cast.n.isnull()
not_ranked_n = inception_cast[n_nas]
len(not_ranked_n)

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [13]:
n_not_na = inception_cast.n.notnull()
ranked_n = inception_cast[n_not_na]
len(ranked_n)

51

In [14]:
# sanity check
len(ranked_n) + len(not_ranked_n) == 78

True

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [14]:
north = cast[cast.title == 'North by Northwest']
north = north[north.n.notnull()]
north.sort_values('n')

,title,year,name,type,character,n
797150,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3201980,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1333732,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2878461,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
326415,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2780220,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1551491,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1167105,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2239203,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1657968,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
609229,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2100440,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
425645,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1379980,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
189719,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1267109,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [7]:
sleuth_1972 = cast[(cast.title == "Sleuth") & (cast.year == 1972)]
sleuth_1972.sort_values('n')

,title,year,name,type,character,n
1560814,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
299291,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
342151,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1341313,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2490141,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1325945,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [8]:
sleuth_2007 = cast[(cast.title == 'Sleuth') & (cast.year == 2007)]
sleuth_2007.sort_values('n')

          title  year                 name     type          character    n
299292   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1183659  Sleuth  2007             Jude Law    actor               Milo  2.0
1652936  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
238747   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
342152   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2490140  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3069393  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [15]:
hamlet = cast[cast.title == "Hamlet"]
hamlet = hamlet[hamlet.year == 1921]
len(hamlet)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [16]:
hamlet_1996 = cast[(cast.title == "Hamlet") & (cast.year == 1996)]
len(hamlet_1996)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [22]:
hamlet_character = cast[cast.character == 'Hamlet']
len(hamlet_character)

93

### How many people have played an "Ophelia"?

In [37]:
# Original thought: 
c = cast.character == "Ophelia"
c = cast[c]
len(c)

102

In [43]:
# Why is the above solution wrong? 
# well, we are asking a counting question can we possibly be over counting? 
# The question is asking how many people have played the role "Ophelia"
# not how many "Ophelia" roles have been creditied. The above solution answers 
# how many "Ophelia" roles have been creditied which leaves the possibility to 
# overcount if the same person plays the "Ophelia" roll twice

# Now we will see if there was anyone who has played the roll twice. 
print(c.name.is_unique)

# Since the name column is not unique there exists at least one person who has played the roll twice 
# we can see exactly how many people have this way 
c.name.value_counts()

# So Louise Beavers is the only person who has played the role "Ophelia" twice.

False

Louise Beavers        2
Amy Bourque           1
Francesca Murdoch     1
Cherry Pie Picache    1
Mattie Peters         1
                     ..
Joanne Farrell        1
Marianne Faithfull    1
Helen (XI) Evans      1
Gertrude Elliot       1
Kate Winslet          1
Name: name, Length: 101, dtype: int64

In [47]:
# How can we properly answer this question? By usuing the unique attribute! 

c = c.name.unique()
len(c)

101

In [55]:
# Another way to write the solution 
c = cast[cast.character == 'Ophelia'].name.unique()
len(c)

101

### How many people have played a role called "The Dude"?

In [56]:
d = cast[cast.character == "The Dude"].name.unique()
len(d)

17

### How many people have played a role called "The Stranger"?

In [57]:
s = cast[cast.character == "The Stranger"].name.unique()
len(s)

160

### How many roles has Sidney Poitier played throughout his career?

In [59]:
sid = cast[cast.name == 'Sidney Poitier']
len(sid)

43

### How many roles has Judi Dench played?

In [60]:
judi = cast[cast.name == 'Judi Dench']
len(judi)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [71]:
cary_support = cast[cast.name == 'Cary Grant']
cary_support = cary_support[(cary_support.n == 2) & (cary_support.year // 10 * 10 == 1940)]
cary_support.sort_values('year')

                   title  year        name   type    character    n
797147  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
797157    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [74]:
lead_cary_1940s = cast[(cast.name == 'Cary Grant') & ((cast.year // 10) * 10 == 1940) & (cast.n == 1)]
lead_cary_1940s.sort_values('year')

,title,year,name,type,character,n
797172,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
797131,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
797174,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
797162,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
797176,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
797153,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
797122,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
797146,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
797154,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
797114,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
797149,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
797148,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
797151,Notorious,1946,Cary Grant,actor,Devlin,1.0
797168,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
797169,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
797145,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
797126,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
797135,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [81]:
actor_roles_1950 = cast[(cast.year // 10 * 10 == 1950) & (cast.type == 'actor')]
len(actor_roles_1950)

153559

### How many roles were available for actresses in the 1950s?

In [84]:
actress_roles_1950 = cast[(cast.year // 10 == 195) & (cast.type == 'actress')]
len(actress_roles_1950)

56331

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [87]:
lead_roles = cast[(cast.n == 1) & (cast.year < 1981)]
len(lead_roles)

62763

### How many non-leading roles were available through from the beginning of film history through 1980?

In [88]:
non_leading_roles = cast[(cast.n != 1) & (cast.year < 1981)]
len(non_leading_roles)

1078306

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [89]:
non_numeric_roles = cast[(cast.n.isnull()) & (cast.year < 1981)]
len(non_numeric_roles)

437383

# Exercise 1 Lecture Notes

In [4]:
titles

                                       title  year
0       Amore e morte nel giardino degli dei  1972
1                                       Kris  1946
2                            Kaptein Caprivi  1972
3                              Svenska Floyd  1961
4                                 Homo Faber  1991
...                                      ...   ...
226008                Les mannequins d'osier  1989
226009                                Krejzi  1989
226010                               Kvinder  1914
226011             Il racconto della giungla  1974
226012                              Soul Men  2008

[226013 rows x 2 columns]

In [5]:
# The number of rows 
len(titles)

226013

`head()` and `tail()` are data operations, it builds a new dataframe. It can be used to subset the data after sorting.

In [8]:
# subset of dataframe, default first 5 rows
h = titles.head()

In [10]:
h

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961
4                            Homo Faber  1991

In [7]:
# subset of dataframe, default last 5 rows
titles.tail()

                            title  year
226008     Les mannequins d'osier  1989
226009                     Krejzi  1989
226010                    Kvinder  1914
226011  Il racconto della giungla  1974
226012                   Soul Men  2008

# Filtering

In [17]:
# turn years into decades 
h['year'] // 10 * 10

0    1970
1    1940
2    1970
3    1960
4    1990
Name: year, dtype: int64

In [21]:
h.year > 1985

0    False
1    False
2    False
3    False
4     True
Name: year, dtype: bool

In [22]:
h[h.year > 1985]

        title  year
4  Homo Faber  1991

In [24]:
h[h.year < 1985]

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961

In [27]:
h[ (h.year < 1980) | (h.year >= 1990)]

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961
4                            Homo Faber  1991

In [31]:
t = titles
t[t.title == 'Macbeth'].sort_values('year')

          title  year
159270  Macbeth  1913
21953   Macbeth  1916
111344  Macbeth  1948
124768  Macbeth  1987
159785  Macbeth  1997
120749  Macbeth  1998
56595   Macbeth  2003
169330  Macbeth  2004
49201   Macbeth  2006
27926   Macbeth  2009
143334  Macbeth  2012
71257   Macbeth  2013
44908   Macbeth  2014
109475  Macbeth  2015
90867   Macbeth  2017
44934   Macbeth  2018

In [32]:
t = titles
t[t.title == 'Macbeth'].sort_values('year').head()

          title  year
159270  Macbeth  1913
21953   Macbeth  1916
111344  Macbeth  1948
124768  Macbeth  1987
159785  Macbeth  1997

In [33]:
t = titles
t[t.title == 'Macbeth'].sort_values('year').tail()

          title  year
71257   Macbeth  2013
44908   Macbeth  2014
109475  Macbeth  2015
90867   Macbeth  2017
44934   Macbeth  2018

In [36]:
h = cast.head()
h[h.n.notnull()]

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0